In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('C:/Rajshekar/LetsUpgrade/Assignments/Datasets/train (5).csv')

In [3]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
dataset1 = dataset.drop(['Name','Ticket','Cabin'],axis=1)

In [5]:
dataset1

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
888,889,0,3,female,NaN,1,2,23.4500,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

In [6]:
dataset1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [7]:
dataset1['Age'] = round(dataset1['Age'].fillna(dataset1['Age'].mean()))

In [8]:
from sklearn import preprocessing

In [9]:
from sklearn.model_selection import train_test_split

In [10]:
from sklearn.naive_bayes import GaussianNB

In [11]:
from sklearn.metrics import accuracy_score

In [12]:
from sklearn.metrics import confusion_matrix

In [13]:
le = preprocessing.LabelEncoder()

In [14]:
le.fit(dataset1['Sex'])
dataset1['Sex'] = le.transform(dataset1['Sex'])

In [15]:
dataset1.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    1  22.0      1      0   7.2500        S
1            2         1       1    0  38.0      1      0  71.2833        C
2            3         1       3    0  26.0      0      0   7.9250        S
3            4         1       1    0  35.0      1      0  53.1000        S
4            5         0       3    1  35.0      0      0   8.0500        S

In [16]:
dataset2 = dataset1.drop(['PassengerId','Embarked'],axis=1)

In [17]:
y = dataset2['Survived']

In [18]:
x = dataset2.drop(['Survived'],axis=1)

In [19]:
y.count()

891

In [20]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)

In [21]:
x_train

     Pclass  Sex   Age  SibSp  Parch     Fare
857       1    1  51.0      0      0  26.5500
52        1    0  49.0      1      0  76.7292
386       3    1   1.0      5      2  46.9000
124       1    1  54.0      0      1  77.2875
578       3    0  30.0      1      0  14.4583
..      ...  ...   ...    ...    ...      ...
835       1    0  39.0      1      1  83.1583
192       3    0  19.0      1      0   7.8542
629       3    1  30.0      0      0   7.7333
559       3    0  36.0      1      0  17.4000
684       2    1  60.0      1      1  39.0000

[623 rows x 6 columns]

In [22]:
x_test

     Pclass  Sex   Age  SibSp  Parch      Fare
495       3    1  30.0      0      0   14.4583
648       3    1  30.0      0      0    7.5500
278       3    1   7.0      4      1   29.1250
31        1    0  30.0      1      0  146.5208
255       3    0  29.0      0      2   15.2458
..      ...  ...   ...    ...    ...       ...
263       1    1  40.0      0      0    0.0000
718       3    1  30.0      0      0   15.5000
620       3    1  27.0      1      0   14.4542
786       3    0  18.0      0      0    7.4958
64        1    1  30.0      0      0   27.7208

[268 rows x 6 columns]

In [23]:
from sklearn.naive_bayes import *

In [24]:
clf = BernoulliNB()

In [25]:
y_pred = clf.fit(x_train,y_train).predict(x_test)

In [26]:
accuracy_score(y_test,y_pred,normalize=True)

0.7873134328358209

In [27]:
confusion_matrix (y_test,y_pred)

array([[140,  28],
       [ 29,  71]], dtype=int64)

In [28]:
y = dataset2['Pclass']

In [29]:
x = dataset2.drop(['Pclass'],axis=1)

In [30]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)
y_pred = clf.fit(x_train,y_train).predict(x_test)

In [31]:
accuracy_score(y_test,y_pred,normalize=True)

0.5746268656716418

In [32]:
confusion_matrix (y_test,y_pred)

array([[ 30,   0,  30],
       [ 22,   0,  30],
       [ 31,   1, 124]], dtype=int64)

In [33]:
y = dataset2['Sex']
x = dataset2.drop(['Sex'],axis=1)

In [34]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)
y_pred = clf.fit(x_train,y_train).predict(x_test)

In [35]:
confusion_matrix (y_test,y_pred)

array([[ 71,  28],
       [ 28, 141]], dtype=int64)

In [36]:
accuracy_score(y_test,y_pred,normalize=True)

0.7910447761194029

In [37]:
y = dataset2['Age']
x = dataset2.drop(['Age'],axis=1)

In [38]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)

In [39]:
y_pred = clf.fit(x_train,y_train).predict(x_test)

In [40]:
accuracy_score(y_test,y_pred,normalize=True)

0.23880597014925373

In [41]:
confusion_matrix (y_test,y_pred)

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 3, 0, ..., 0, 0, 0],
       [0, 1, 1, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [42]:
y = dataset2['SibSp']
x = dataset2.drop(['SibSp'],axis=1)
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)
y_pred = clf.fit(x_train,y_train).predict(x_test)
accuracy_score(y_test,y_pred,normalize=True)

0.6791044776119403

In [43]:
confusion_matrix (y_test,y_pred)

array([[162,  19,   0,   0,   0,   0],
       [ 45,  20,   0,   0,   0,   0],
       [  4,   3,   0,   0,   0,   0],
       [  4,   2,   0,   0,   0,   0],
       [  4,   3,   0,   0,   0,   0],
       [  1,   1,   0,   0,   0,   0]], dtype=int64)

In [44]:
dataset2['Fare'] = round(dataset2['Fare'])

In [45]:
dataset2

     Survived  Pclass  Sex   Age  SibSp  Parch  Fare
0           0       3    1  22.0      1      0   7.0
1           1       1    0  38.0      1      0  71.0
2           1       3    0  26.0      0      0   8.0
3           1       1    0  35.0      1      0  53.0
4           0       3    1  35.0      0      0   8.0
..        ...     ...  ...   ...    ...    ...   ...
886         0       2    1  27.0      0      0  13.0
887         1       1    0  19.0      0      0  30.0
888         0       3    0  30.0      1      2  23.0
889         1       1    1  26.0      0      0  30.0
890         0       3    1  32.0      0      0   8.0

[891 rows x 7 columns]

In [46]:
y = dataset2['Fare']
x = dataset2.drop(['Fare'],axis=1)
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)
y_pred = clf.fit(x_train,y_train).predict(x_test)
accuracy_score(y_test,y_pred,normalize=True)

0.25

In [47]:
confusion_matrix (y_test,y_pred)

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)